In [1]:
import pandas as pd
import numpy as np
data={"usn":[1,2,3,4,5,6],
      "name":["shara","bala","rahul","rajesh","lithin","rask"],
     "marks":[98,94,83,95,84,94]}
data

{'usn': [1, 2, 3, 4, 5, 6],
 'name': ['shara', 'bala', 'rahul', 'rajesh', 'lithin', 'rask'],
 'marks': [98, 94, 83, 95, 84, 94]}

In [2]:
df=pd.DataFrame(data)
df

   usn    name  marks
0    1   shara     98
1    2    bala     94
2    3   rahul     83
3    4  rajesh     95
4    5  lithin     84
5    6    rask     94

In [9]:
mean_marks=df["marks"].mean()
mean_marks

91.33333333333333

In [10]:
print(df["name"].value_counts())

name
shara     1
bala      1
rahul     1
rajesh    1
lithin    1
rask      1
Name: count, dtype: int64

In [11]:
# Create two DataFrames
df1 = pd.DataFrame({'key': ['A', 'B', 'C'], 'value1': [10, 20, 30]})
df2 = pd.DataFrame({'key': ['B', 'C', 'D'], 'value2': [40, 50, 60]})

# Merge based on 'key' column
merged_df = pd.merge(df1, df2, on='key', how='inner')
print(merged_df)

  key  value1  value2
0   B      20      40
1   C      30      50